modm-ext/data.modm.io/docs/svd/header_stm32wb15xx.svd
        <register>
          <name>CHSELR</name>
          <description>ADC group regular sequencer register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHSEL0</name>
              <description>ADC group regular sequencer channel 0, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL1</name>
              <description>ADC group regular sequencer channel 1, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL2</name>
              <description>ADC group regular sequencer channel 2, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL3</name>
              <description>ADC group regular sequencer channel 3, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL4</name>
              <description>ADC group regular sequencer channel 4, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL5</name>
              <description>ADC group regular sequencer channel 5, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL6</name>
              <description>ADC group regular sequencer channel 6, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL7</name>
              <description>ADC group regular sequencer channel 7, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL8</name>
              <description>ADC group regular sequencer channel 8, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL9</name>
              <description>ADC group regular sequencer channel 9, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL10</name>
              <description>ADC group regular sequencer channel 10, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL11</name>
              <description>ADC group regular sequencer channel 11, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL12</name>
              <description>ADC group regular sequencer channel 12, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL13</name>
              <description>ADC group regular sequencer channel 13, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL14</name>
              <description>ADC group regular sequencer channel 14, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL15</name>
              <description>ADC group regular sequencer channel 15, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL16</name>
              <description>ADC group regular sequencer channel 16, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL17</name>
              <description>ADC group regular sequencer channel 17, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHSEL18</name>
              <description>ADC group regular sequencer channel 18, available when ADC_CFGR1_CHSELRMOD is reset</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SQ6</name>
              <description>ADC group regular sequencer rank 6, available when ADC_CFGR1_CHSELRMOD is set</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SQ7</name>
              <description>ADC group regular sequencer rank 7, available when ADC_CFGR1_CHSELRMOD is set</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SQ8</name>
              <description>ADC group regular sequencer rank 8, available when ADC_CFGR1_CHSELRMOD is set</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CHSELR_ALT</name>
          <description>ADC group regular sequencer register</description>
          <alternateRegister>CHSELR</alternateRegister>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SQ1</name>
              <description>ADC group regular sequencer rank 1, available when ADC_CFGR1_CHSELRMOD is set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SQ2</name>
              <description>ADC group regular sequencer rank 2, available when ADC_CFGR1_CHSELRMOD is set</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SQ3</name>
              <description>ADC group regular sequencer rank 3, available when ADC_CFGR1_CHSELRMOD is set</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SQ4</name>
              <description>ADC group regular sequencer rank 4, available when ADC_CFGR1_CHSELRMOD is set</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SQ5</name>
              <description>ADC group regular sequencer rank 5, available when ADC_CFGR1_CHSELRMOD is set</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SQ6</name>
              <description>ADC group regular sequencer rank 6, available when ADC_CFGR1_CHSELRMOD is set</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SQ7</name>
              <description>ADC group regular sequencer rank 7, available when ADC_CFGR1_CHSELRMOD is set</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SQ8</name>
              <description>ADC group regular sequencer rank 8, available when ADC_CFGR1_CHSELRMOD is set</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <description>ADC group regular data register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>ADC group regular conversion data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CALFACT</name>
          <description>ADC Calibration factor register</description>
          <addressOffset>0xb4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CALFACT</name>
              <description>ADC calibration factor in single-ended mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <description>ADC common configuration register</description>
          <addressOffset>0x308</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRESC</name>
              <description>ADC common clock prescaler, only for clock source asynchronous</description>
              <bitOffset>18</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>VREFEN</name>
              <description>ADC internal path to VrefInt enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSEN</name>
              <description>ADC internal path to temperature sensor enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VBATEN</name>
              <description>ADC internal path to battery voltage enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
